In [10]:
ls

Project1.ipynb  Salary_dataset.csv

In [11]:
import pandas as pd
data = pd.read_csv('Salary_dataset.csv')
data.head()

   No  YearsExperience   Salary
0   0              1.2  39344.0
1   1              1.4  46206.0
2   2              1.6  37732.0
3   3              2.1  43526.0
4   4              2.3  39892.0

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   No               30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 848.0 bytes

In [13]:
data = data.set_index('No')

In [14]:
data.head()

    YearsExperience   Salary
No
0               1.2  39344.0
1               1.4  46206.0
2               1.6  37732.0
3               2.1  43526.0
4               2.3  39892.0

In [15]:
data.corr()

                 YearsExperience    Salary
YearsExperience         1.000000  0.978242
Salary                  0.978242  1.000000

In [16]:
data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.413333   76004.000000
std           2.837888   27414.429785
min           1.200000   37732.000000
25%           3.300000   56721.750000
50%           4.800000   65238.000000
75%           7.800000  100545.750000
max          10.600000  122392.000000

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 720.0 bytes

In [18]:
x = data["YearsExperience"]
y = data["Salary"]

In [19]:
x.describe()

count    30.000000
mean      5.413333
std       2.837888
min       1.200000
25%       3.300000
50%       4.800000
75%       7.800000
max      10.600000
Name: YearsExperience, dtype: float64

In [20]:
y.describe()

count        30.000000
mean      76004.000000
std       27414.429785
min       37732.000000
25%       56721.750000
50%       65238.000000
75%      100545.750000
max      122392.000000
Name: Salary, dtype: float64

In [21]:
plt.scatter(y,x)
plt.show()
np.corrcoef(y,x)[0,1]

NameError: name 'plt' is not defined

In [ ]:
pip install statsmodels

Collecting statsmodels
  Downloading statsmodels-0.13.5-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (9.9 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 9.9/9.9 MB 65.7 MB/s eta 0:00:00:00:0100:01
Collecting patsy>=0.5.2
  Downloading patsy-0.5.3-py2.py3-none-any.whl (233 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 233.8/233.8 kB 12.0 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.17 in /home/codespace/.local/lib/python3.10/site-packages (from statsmodels) (1.24.2)
Requirement already satisfied: pandas>=0.25 in /home/codespace/.local/lib/python3.10/site-packages (from statsmodels) (1.5.3)
Requirement already satisfied: scipy>=1.3 in /home/codespace/.local/lib/python3.10/site-packages (from statsmodels) (1.10.1)
Requirement already satisfied: packaging>=21.3 in /home/codespace/.local/lib/python3.10/site-packages (from statsmodels) (23.0)
Requirement already satisfied: python-dateutil>=2.8.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas>=0.25->statsmodels) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas>=0.25->statsmodels) (2022.7.1)
Requirement already satisfied: six in /home/codespace/.local/lib/python3.10/site-packages (from patsy>=0.5.2->statsmodels) (1.16.0)
Installing collected packages: patsy, statsmodels
Successfully installed patsy-0.5.3 statsmodels-0.13.5
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import statsmodels.formula.api as smf

In [22]:
data.head()

    YearsExperience   Salary
No
0               1.2  39344.0
1               1.4  46206.0
2               1.6  37732.0
3               2.1  43526.0
4               2.3  39892.0

In [23]:
data.size

60

In [24]:
data.shape

(30, 2)

In [25]:
#OLS